import React from "react";
import Fade from "react-reveal/Fade";

import glass from "../../../img/headers/glass.webp";

import "./about.css";

export default function About() {
  const decipherCases = [
    "שמירה על סטנדרטים גבוהים ביותר זה למעלה מ-30 שנה.",
    'שיתוף פעולה עם חוקרים מקצועיים יוצאי משטרה, צה"ל ויחידות מודיעין מובחרות, וכן עם אנשי מחשבים ותקשורת מהשורה הראשונה.',
    "שילוב שיטות חקירה מסורתיות ובדוקות עם טכנולוגיה מתקדמת.",
    "עבודה מול מספר סניפים ונציגויות בארץ, בבודפשט, בניו-יורק, לוס אנג'לס וקנדה.",
  ];

  return (
    <div className='section-container'>
      <Fade bottom>
        <img className='about-img' src={glass}></img>
      </Fade>
      <a href='#container'>
        <div class='arrow'></div>
      </a>
      <div id='container'></div>
      <Fade bottom>
        <h4 className='second-title'>
          {" "}
          מטרתנו: לספק ללקוחות מידע, סיוע והגנה תוך שמירה על דיסקרטיות מלאה,
          יושרה, מקצועיות, אמינות ונאמנות!{" "}
        </h4>
        <ul className='invest-list'>
          <li>
            <h5 className='list-item'>
              {" "}
              אנו ב- "תירם מידע וחקירות" עוסקים כבר יותר משלושה עשורים בביצוע
              חקירות כלכליות, חקירות אישות, מודיעין עסקי, בדיקות פוליגרף ועוד,
              לצד מתן ייעוץ, ליווי והדרכה בהתאם לצורכי הלקוח. עם לקוחותינו נמנים
              גופים מסחריים שונים, משרדי עורכי דין, רואי חשבון ואנשים פרטיים.
            </h5>
          </li>
        </ul>
      </Fade>
      <Fade bottom>
        <h4 className='second-title'>
          {" "}
          מה מאפשר לנו לפענח מקרים ולבצע משימות עם אחוזי הצלחה מהגבוהים בענף?{" "}
        </h4>
        <ul className='invest-list'>
          {decipherCases.map((item) => {
            return (
              <li>
                <h5 className='list-item'> {item} </h5>
              </li>
            );
          })}
        </ul>
      </Fade>
      <Fade bottom>
        <h4 className='second-title'>הטובים לתירם</h4>
        <ul className='invest-list'>
          <li>
            <h5 className='list-text'>
              צוות תירם מידע וחקירות מורכב מאנשי מקצוע ותיקים ומנוסים בתחומם,
              כגון: יוצאי משטרת ישראל, צה"ל ויחידות מודיעין מובחרות; חוקרים
              פרטיים מקצועיים מתחומי הבנקאות והכלכלה; ואנשי מחשבים ותקשורת.
              במשרד צוות שעוסק בחקירות פרטיות, לצד צוות המתמחה בביצוע חקירות
              בחו"ל – בדגש על אירופה, ארצות הברית ודרום אמריקה. כמו כן, אנו
              מקפידים להיעזר במידת הצורך במומחים וביועצים מהמעלה הראשונה במגוון
              רחב של תחומים.
            </h5>
            <br />
          </li>
          <li>
            <h5 className='list-text'>
              ד"ר רפאל תירם – מייסד ובעלים, בעל ניסיון מוכח מעל 38 שנים בתחום
              החקירות והבילוש. ד"ר תירם שימש בעבר כקצין במשטרת ישראל וראש צוות
              חקירות מיוחד במשטרת מחוז תל אביב. בנוסף, ד"ר תירם הינו מרצה אורח
              בחוג לקרימינולוגיה באוניברסיטת בר אילן ובוגר מכללת "שערי משפט"
              בהוד השרון.
            </h5>
            <br />
          </li>
        </ul>
      </Fade>
    </div>
  );
}
