import React from "react";

export default function Home() {
  return (
    <div className='section-container'>
      <h3 className='section-title'>
        מידע וחקירות – אחוזי הצלחה מהגבוהים בענף
      </h3>
      <p className='section-text'>
        מידע וחקירות הוא משרד לחקירות פרטיות, הפועל זה למעלה מ-35 שנה ברישיון
        משרד המשפטים ומשמש כחבר באיגוד הישראלי למשרדי חקירות פרטיות וארגוני
        חקירות בחו"ל. אנחנו מאמינים כי הדבר החשוב ביותר ללקוח הוא האינפורמציה
        המדויקת, ולכן אנו מספקים ללקוחותינו קו הגנה ראשוני ומידע חיוני. במטרה
        להגיע לפתרון הטוב ביותר במהירות וביעילות, עומדים לרשותנו: שיטות חקירה
        מקובלות, טכנולוגיות מתקדמות וקשרים שוטפים עם אנשי מפתח בארץ ובעולם.
      </p>

      <p className='section-text'>
        <b>
          מטרתנו העיקרית היא לספק ללקוחותינו מידע, סיוע והגנה בהתאם לצרכיהם ותוך
          שמירה מוחלטת על סודיות. כמו כן, אנו מקפידים לעבוד לפי ערכים בסיסיים של
          יושרה, מקצועיות, שמירה על החוק, אמינות ונאמנות ללקוח.
        </b>
      </p>
    </div>
  );
}
